jFoster426/jFoster426.github.io/Projects/DIYPACEISB/PACE ISB Cubby/Microchip.PIC16Fxxx_DFP.1.7.162/edc/PIC16F570.PIC
        <edc:Mirror edc:nzsize="2" edc:regionidref="sfr1" edc:_addr="0x6A"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="4" edc:beginaddr="0x80" edc:endaddr="0x8C" edc:regionid="sfr4">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="5" edc:beginaddr="0xA0" edc:endaddr="0xAC" edc:regionid="sfr5">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr1" edc:_addr="0xA0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="6" edc:beginaddr="0xC0" edc:endaddr="0xCC" edc:regionid="sfr6">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xC0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="7" edc:beginaddr="0xE0" edc:endaddr="0xEC" edc:regionid="sfr7">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr3" edc:_addr="0xE0"/>
      </edc:SFRDataSector>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0xc" edc:endaddr="0x10" edc:regionid="gpr0a"/>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x10" edc:endaddr="0x20" edc:regionid="gpr0b"/>
      <edc:GPRDataSector edc:bank="1" edc:beginaddr="0x2c" edc:endaddr="0x30" edc:regionid="gpr1a" edc:shadowidref="gpr0a"/>
      <edc:GPRDataSector edc:bank="1" edc:beginaddr="0x30" edc:endaddr="0x40" edc:regionid="gpr1b"/>
      <edc:GPRDataSector edc:bank="2" edc:beginaddr="0x4c" edc:endaddr="0x50" edc:regionid="gpr2a" edc:shadowidref="gpr0a"/>
      <edc:GPRDataSector edc:bank="2" edc:beginaddr="0x50" edc:endaddr="0x60" edc:regionid="gpr2b"/>
      <edc:GPRDataSector edc:bank="3" edc:beginaddr="0x6c" edc:endaddr="0x70" edc:regionid="gpr3a" edc:shadowidref="gpr0a"/>
      <edc:GPRDataSector edc:bank="3" edc:beginaddr="0x70" edc:endaddr="0x80" edc:regionid="gpr3b"/>
      <edc:EmulatorZone edc:beginaddr="0x8a" edc:endaddr="0x8c" edc:regionid="emulatorzone"/>
      <edc:GPRDataSector edc:bank="4" edc:beginaddr="0x8c" edc:endaddr="0x90" edc:regionid="gpr4a" edc:shadowidref="gpr0a"/>
      <edc:GPRDataSector edc:bank="4" edc:beginaddr="0x90" edc:endaddr="0xa0" edc:regionid="gpr4b"/>
      <edc:GPRDataSector edc:bank="5" edc:beginaddr="0xac" edc:endaddr="0xb0" edc:regionid="gpr5a" edc:shadowidref="gpr0a"/>
      <edc:GPRDataSector edc:bank="5" edc:beginaddr="0xb0" edc:endaddr="0xc0" edc:regionid="gpr5b"/>
      <edc:GPRDataSector edc:bank="6" edc:beginaddr="0xcc" edc:endaddr="0xd0" edc:regionid="gpr6a" edc:shadowidref="gpr0a"/>
      <edc:GPRDataSector edc:bank="6" edc:beginaddr="0xd0" edc:endaddr="0xe0" edc:regionid="gpr6b"/>
      <edc:GPRDataSector edc:bank="7" edc:beginaddr="0xec" edc:endaddr="0xf0" edc:regionid="gpr7a" edc:shadowidref="gpr0a"/>
      <edc:GPRDataSector edc:bank="7" edc:beginaddr="0xf0" edc:endaddr="0x100" edc:regionid="gpr7b"/>
      <edc:NMMRPlace edc:regionid="corenmmrs">
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WREG" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="qqqqqqqq" edc:name="WREG" edc:nzwidth="0x8" edc:por="qqqqqqqq" edc:nmmrid="0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG" edc:desc="" edc:mask="0xff" edc:name="WREG" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="STKPTR" edc:desc="" edc:impl="0xff" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="STKPTR" edc:nzwidth="0x8" edc:por="00000000" edc:nmmrid="63">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STKPTR" edc:desc="" edc:mask="0xff" edc:name="STKPTR" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TRISA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xx11x111" edc:name="TRISA" edc:nzwidth="0x8" edc:por="xx11x111" edc:nmmrid="2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISA0" edc:desc="" edc:mask="0x1" edc:name="TRISA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISA1" edc:desc="" edc:mask="0x1" edc:name="TRISA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISA2" edc:desc="" edc:mask="0x1" edc:name="TRISA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISA3" edc:desc="" edc:mask="0x1" edc:name="TRISA3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISA4" edc:desc="" edc:mask="0x1" edc:name="TRISA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISA5" edc:desc="" edc:mask="0x1" edc:name="TRISA5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISA6" edc:desc="" edc:mask="0x1" edc:name="TRISA6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISA7" edc:desc="" edc:mask="0x1" edc:name="TRISA7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TRISB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111xxxx" edc:name="TRISB" edc:nzwidth="0x8" edc:por="1111xxxx" edc:nmmrid="67">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISB0" edc:desc="" edc:mask="0x1" edc:name="TRISB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISB1" edc:desc="" edc:mask="0x1" edc:name="TRISB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISB2" edc:desc="" edc:mask="0x1" edc:name="TRISB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISB3" edc:desc="" edc:mask="0x1" edc:name="TRISB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISB4" edc:desc="" edc:mask="0x1" edc:name="TRISB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB5" edc:desc="" edc:mask="0x1" edc:name="TRISB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISB6" edc:desc="" edc:mask="0x1" edc:name="TRISB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISB7" edc:desc="" edc:mask="0x1" edc:name="TRISB7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TRISC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="TRISC" edc:nzwidth="0x8" edc:por="11111111" edc:nmmrid="70">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISC0" edc:desc="" edc:mask="0x1" edc:name="TRISC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC1" edc:desc="" edc:mask="0x1" edc:name="TRISC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC2" edc:desc="" edc:mask="0x1" edc:name="TRISC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC3" edc:desc="" edc:mask="0x1" edc:name="TRISC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC4" edc:desc="" edc:mask="0x1" edc:name="TRISC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC5" edc:desc="" edc:mask="0x1" edc:name="TRISC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISC6" edc:desc="" edc:mask="0x1" edc:name="TRISC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISC7" edc:desc="" edc:mask="0x1" edc:name="TRISC7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="OPTION_REG" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="OPTION_REG" edc:nzwidth="0x8" edc:por="11111111" edc:nmmrid="61">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PS" edc:desc="" edc:mask="0x7" edc:name="PS" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PSA" edc:desc="" edc:mask="0x1" edc:name="PSA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0SE" edc:desc="" edc:mask="0x1" edc:name="T0SE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CS" edc:desc="" edc:mask="0x1" edc:name="T0CS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nRBPU" edc:desc="" edc:mask="0x1" edc:name="nRBPU" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nRBWU" edc:desc="" edc:mask="0x1" edc:name="nRBWU" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PS0" edc:desc="" edc:mask="0x1" edc:name="PS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS1" edc:desc="" edc:mask="0x1" edc:name="PS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS2" edc:desc="" edc:mask="0x1" edc:name="PS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="BSR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----xxx" edc:name="BSR" edc:nzwidth="8" edc:por="-----xxx" edc:nmmrid="9">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BSR" edc:desc="" edc:mask="0x7" edc:name="BSR" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:NMMRPlace>
    </edc:RegardlessOfMode>
  </edc:DataSpace>
  <edc:PinList edc:ppsflavor="none">
    <edc:Pin>
      <edc:VirtualPin edc:name="VPP"/>
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="AN0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="C1IN+"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="CVREF1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="C2IN+"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="T0CKI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="AN5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA7"/>
      <edc:VirtualPin edc:name="CLKIN"/>
      <edc:VirtualPin edc:name="OSC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA6"/>
      <edc:VirtualPin edc:name="CLKOUT"/>
      <edc:VirtualPin edc:name="OSC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC1"/>
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="OPA1OUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC2"/>
      <edc:VirtualPin edc:name="OPA1IN-"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC3"/>
      <edc:VirtualPin edc:name="OPA1IN+"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC4"/>
      <edc:VirtualPin edc:name="OPA2IN+"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC5"/>
      <edc:VirtualPin edc:name="OPA2IN-"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC6"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="OPA2OUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC7"/>
      <edc:VirtualPin edc:name="C2IN-"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB3"/>
      <edc:VirtualPin edc:name="C1OUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB4"/>
      <edc:VirtualPin edc:name="C2OUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB6"/>
      <edc:VirtualPin edc:name="ICSPCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="ICSPDAT"/>
      <edc:VirtualPin edc:name="C1IN-"/>
      <edc:VirtualPin edc:name="CVREF2"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
